dlbogdan/Garage-Door-ESP32/components/management_api/management_api.cpp
const char* movement_phase_name(gate::signal_decoder::MovementRulePhase value) {
  using P = gate::signal_decoder::MovementRulePhase;
  switch (value) {
    case P::kUnmatched: return "unmatched";
    case P::kEntryPending: return "entryPending";
    case P::kMatched: return "matched";
    case P::kLossPending: return "lossPending";
    case P::kExpired: return "expired";
  }
  return "unmatched";
}

std::string decoder_config_json(const gate::config::FeedbackDecoderConfig& decoder) {
  using namespace gate::signal_decoder;
  std::string json = "{\"version\":4,\"profile\":\"";
  json += decoder.profile == gate::config::FeedbackDecoderProfile::kCustomRules
              ? "customRules"
              : "endpointPreset";
  json += "\",\"limits\":{\"inputs\":4,\"rules\":8,\"groupsPerRule\":2,\"predicatesPerGroup\":3},\"inputs\":[";
  for (std::uint8_t i = 0; i < decoder.input_count; ++i) {
    if (i) json += ',';
    const auto& input = decoder.inputs[i];
    json += "{\"id\":" + std::to_string(input.id) + ",\"label\":\"" +
            json_escape(input.label.c_str()) + "\",\"gpio\":" +
            std::to_string(input.electrical.gpio) + ",\"activeLevel\":\"" +
            (input.electrical.active_level == gate::config::ActiveLevel::kHigh ? "high" : "low") +
            "\",\"pull\":\"" +
            (input.electrical.pull == gate::config::SensorPull::kNone ? "none" :
             input.electrical.pull == gate::config::SensorPull::kDown ? "down" : "up") +
            "\",\"debounceMs\":" + std::to_string(input.electrical.debounce_ms) + "}";
  }
  json += "],\"rules\":[";
  for (std::uint8_t r = 0; r < decoder.rules.rule_count; ++r) {
    if (r) json += ',';
    const auto& rule = decoder.rules.rules[r];
    std::string outcome;
    if (rule.output.kind == RuleOutputKind::kPosition) {
      outcome = rule.output.position == PositionValue::kOpened ? "opened" : "closed";
    } else if (rule.output.kind == RuleOutputKind::kMovement) {
      outcome = rule.output.movement == MovementValue::kOpening ? "opening" :
                rule.output.movement == MovementValue::kClosing ? "closing" : "stopped";
    } else outcome = "obstructed";
    const char* expiry = rule.movement.expiry == MatchAgeExpiry::kUnknown ? "unknown" :
                         rule.movement.expiry == MatchAgeExpiry::kObstructed ? "obstructed" :
                         rule.movement.expiry == MatchAgeExpiry::kUnknownAndObstructed ? "unknownAndObstructed" : "none";
    json += "{\"id\":" + std::to_string(rule.id) + ",\"label\":\"" +
            json_escape(decoder.rule_labels[r].c_str()) + "\",\"enabled\":" +
            (rule.enabled ? "true" : "false") + ",\"outcome\":\"" + outcome +
            "\",\"entryConfirmationMs\":" + std::to_string(rule.movement.entry_confirmation_ms) +
            ",\"lossConfirmationMs\":" + std::to_string(rule.movement.loss_confirmation_ms) +
            ",\"matchAgeLimitMs\":" + std::to_string(rule.movement.match_age_limit_ms) +
            ",\"matchAgeExpiry\":\"" + expiry + "\",\"groups\":[";
    for (std::uint8_t g = 0; g < rule.group_count; ++g) {
      if (g) json += ',';
      json += "[";
      for (std::uint8_t p = 0; p < rule.groups[g].predicate_count; ++p) {
        if (p) json += ',';
        const auto& predicate = rule.groups[g].predicates[p];
        json += "{\"kind\":\"";
        if (predicate.kind == PredicateKind::kStableLevel) {
          json += "stableLevel\",\"inputId\":" + std::to_string(predicate.input_id) +
                  ",\"level\":" + (predicate.stable.level ? "1" : "0") +
                  ",\"holdMs\":" + std::to_string(predicate.stable.hold_ms);
        } else {
          json += "periodicEdges\",\"inputId\":" + std::to_string(predicate.input_id) +
                  ",\"minimumIntervalMs\":" + std::to_string(predicate.periodic.minimum_interval_ms) +
                  ",\"maximumIntervalMs\":" + std::to_string(predicate.periodic.maximum_interval_ms) +
                  ",\"minimumEdges\":" + std::to_string(predicate.periodic.minimum_edges) +
                  ",\"observationWindowMs\":" + std::to_string(predicate.periodic.observation_window_ms) +
                  ",\"maximumGapMs\":" + std::to_string(predicate.periodic.maximum_gap_ms);
        }
        json += "}";
      }
      json += "]";
    }
    json += "]}";
  }
  return json + "]}";
}

esp_err_t login_handler(httpd_req_t* request) {
  if (!provisioned()) {
    return send_error(request, "409 Conflict", "Device is not provisioned.");
  }
  if (request->content_len <= 0 || request->content_len > 256) {
    return send_error(request, "400 Bad Request", "Invalid login request.");
  }
  std::string body(request->content_len, '\0');
  std::size_t received = 0;
  while (received < body.size()) {
    const int count = httpd_req_recv(request, body.data() + received,
                                     body.size() - received);
    if (count <= 0) return ESP_FAIL;
    received += static_cast<std::size_t>(count);
  }
  std::string password;
  if (!form_value(body, "password", &password) ||
      !gate::config::verify_admin_password(password, config().admin)) {
    std::fill(password.begin(), password.end(), '\0');
    vTaskDelay(pdMS_TO_TICKS(500));
    return send_error(request, "401 Unauthorized", "Incorrect password.");
  }
  std::fill(password.begin(), password.end(), '\0');
  gate::web_auth::create_session();
  const std::string cookie = "gate_session=" + gate::web_auth::token() +
      "; Path=/; HttpOnly; SameSite=Strict; Max-Age=28800";
  httpd_resp_set_hdr(request, "Set-Cookie", cookie.c_str());
  httpd_resp_set_type(request, "application/json");
  const std::string response = "{\"csrf\":\"" + gate::web_auth::csrf() + "\"}";
  return httpd_resp_send(request, response.c_str(), response.size());
}

esp_err_t session_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request)) {
    return send_error(request, "401 Unauthorized", "Authentication required.");
  }
  const std::string response = "{\"authenticated\":true,\"csrf\":\"" +
                               gate::web_auth::csrf() + "\"}";
  httpd_resp_set_type(request, "application/json");
  httpd_resp_set_hdr(request, "Cache-Control", "no-store");
  return httpd_resp_send(request, response.c_str(), response.size());
}

esp_err_t config_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request)) {
    return send_error(request, "401 Unauthorized", "Authentication required.");
  }
  const auto& op = config().gate_operator;
  const bool directional = op.profile == gate::config::OperatorProfile::kDirectional;
  const bool dual = op.feedback_topology == gate::config::FeedbackTopology::kDual;
  const bool custom_decoder =
      op.decoder.profile == gate::config::FeedbackDecoderProfile::kCustomRules;
  const auto& relay = directional ? op.open : op.step;
  const auto& sensor = dual ? op.opened_feedback : op.single_feedback;
  const std::string response =
      "{\"displayName\":\"" + json_escape(config().homekit.display_name.c_str()) +
      "\",\"ssid\":\"" + json_escape(config().wifi.ssid.c_str()) +
      "\",\"schemaVersion\":" +
      std::to_string(gate::config::kSchemaVersion) +
      ",\"operatorProfile\":\"" + std::string(directional ? "directional" : "sequential") + "\"" +
      ",\"feedbackMode\":\"" + std::string(dual ? "dual" : "single") + "\"" +
      ",\"feedbackDecoder\":\"" +
      std::string(custom_decoder ? "customRules" : "endpointPreset") + "\"" +
      ",\"decoderInputCount\":" + std::to_string(op.decoder.input_count) +
      ",\"decoderRuleCount\":" + std::to_string(op.decoder.rules.rule_count) +
      ",\"decoder\":" + decoder_config_json(op.decoder) +
      ",\"legacyFlatConfigLossy\":" +
      std::string(directional || dual || custom_decoder ? "true" : "false") +
      ",\"relayGpio\":" + std::to_string(relay.gpio) +
      ",\"relayActiveHigh\":" +
      std::string(relay.active_level == gate::config::ActiveLevel::kHigh ? "true" : "false") +
      ",\"pulseMs\":" + std::to_string(relay.pulse_ms) +
      ",\"openGpio\":" + std::to_string(op.open.gpio) +
      ",\"openActiveHigh\":" + std::string(op.open.active_level == gate::config::ActiveLevel::kHigh ? "true" : "false") +
      ",\"openPulseMs\":" + std::to_string(op.open.pulse_ms) +
      ",\"closeGpio\":" + std::to_string(op.close.gpio) +
      ",\"closeActiveHigh\":" + std::string(op.close.active_level == gate::config::ActiveLevel::kHigh ? "true" : "false") +
      ",\"closePulseMs\":" + std::to_string(op.close.pulse_ms) +
      ",\"sensorGpio\":" + std::to_string(sensor.gpio) +
      ",\"sensorActiveHigh\":" +
      std::string(sensor.active_level == gate::config::ActiveLevel::kHigh ? "true" : "false") +
      ",\"sensorPull\":\"" +
      std::string(sensor.pull == gate::config::SensorPull::kNone ? "none" :
                   sensor.pull == gate::config::SensorPull::kDown ? "down" : "up") + "\"" +
      ",\"feedbackActiveEndpoint\":\"" +
      std::string(op.single_active_endpoint ==
                          gate::config::FeedbackEndpoint::kOpen
                      ? "open" : "closed") + "\"" +
      ",\"feedbackStabilityMs\":" +
      std::to_string(op.endpoint_stability_ms) +
      ",\"openingSeconds\":" + std::to_string(config().timing.opening_ms / 1000) +
      ",\"closingSeconds\":" + std::to_string(config().timing.closing_ms / 1000) +
      ",\"hardwareMonitoring\":" +
      std::string(gate::hardware::monitoring_active() ? "true" : "false") +
      ",\"feedbackActive\":" +
      std::string((gate::hardware::feedback_assertions().opened || gate::hardware::feedback_assertions().closed) ? "true" : "false") +
      ",\"relayControlEnabled\":" +
      std::string(gate::runtime::active() ? "true" : "false") + "}";
  httpd_resp_set_type(request, "application/json");
  httpd_resp_set_hdr(request, "Cache-Control", "no-store");
  return httpd_resp_send(request, response.c_str(), response.size());
}

esp_err_t runtime_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, false, false)) {
    return send_error(request, "401 Unauthorized", "Authentication required.");
  }
  const auto state = gate::runtime::snapshot();
  const auto assertions = gate::hardware::feedback_assertions();
  const auto custom_sample = gate::hardware::feedback_sample();
  const auto decoder = gate::runtime::decoder_snapshot();
  std::string decoder_inputs = "[";
  for (std::uint8_t index = 0; index < custom_sample.count; ++index) {
    if (index != 0) decoder_inputs += ',';
    decoder_inputs += "{\"id\":" +
                      std::to_string(custom_sample.levels[index].id) +
                      ",\"level\":" +
                      (custom_sample.levels[index].level ? "true" : "false") +
                      "}";
  }
  decoder_inputs += ']';
  std::string decoder_rules = "[";
  for (std::uint8_t index = 0; index < decoder.diagnostics.rule_count; ++index) {
    if (index) decoder_rules += ',';
    const auto& rule = decoder.diagnostics.rules[index];
    decoder_rules += "{\"id\":" + std::to_string(rule.id) +
                     ",\"expressionValue\":" + (rule.expression_value ? "true" : "false") +
                     ",\"outputAsserted\":" + (rule.output_asserted ? "true" : "false") +
                     ",\"phase\":\"" + movement_phase_name(rule.movement_phase) +
                     "\",\"matchAgeMs\":" + std::to_string(rule.match_age_ms) + "}";
  }
  decoder_rules += ']';
  std::string decoder_predicates = "[";
  for (std::uint8_t index = 0; index < decoder.diagnostics.predicate_count;
       ++index) {
    if (index) decoder_predicates += ',';
    const auto& predicate = decoder.diagnostics.predicates[index];
    decoder_predicates +=
        "{\"index\":" + std::to_string(index) +
        ",\"value\":" + (predicate.value ? "true" : "false") +
        ",\"evidenceValid\":" +
        (predicate.evidence_valid ? "true" : "false") +
        ",\"evidenceAgeMs\":" +
        std::to_string(predicate.evidence_age_ms) +
        ",\"latestIntervalMs\":" +
        std::to_string(predicate.latest_interval_ms) +
        ",\"estimatedCycleMs\":" +
        std::to_string(predicate.latest_interval_ms * 2U) +
        ",\"qualifyingEdgeCount\":" +
        std::to_string(predicate.qualifying_edge_count) + "}";
  }
  decoder_predicates += ']';
  const std::string response =
      "{\"hardwareMonitoring\":" +
      std::string(gate::hardware::monitoring_active() ? "true" : "false") +
      ",\"feedbackActive\":" +
      std::string((assertions.opened || assertions.closed) ? "true" : "false") +
      ",\"openedAsserted\":" + std::string(assertions.opened ? "true" : "false") +
      ",\"closedAsserted\":" + std::string(assertions.closed ? "true" : "false") +
      ",\"observation\":\"" + std::string(state.observation_valid ? gate::controller::to_string(state.observation) : "UNKNOWN") + "\"" +
      ",\"state\":\"" + std::string(gate::controller::to_string(state.state)) + "\"" +
      ",\"target\":\"" + std::string(gate::controller::to_string(state.target)) + "\"" +
      ",\"activeCommand\":\"" + std::string(gate::controller::to_string(state.active_command)) + "\"" +
      ",\"pulseActive\":" + std::string(state.pulse_active ? "true" : "false") +
      ",\"obstruction\":" + std::string(state.obstruction ? "true" : "false") +
      ",\"chipTemperatureCelsius\":" + chip_temperature_json() +
      ",\"faultReason\":\"" + std::string(gate::controller::to_string(state.fault)) + "\"" +
      ",\"decoderInputs\":" + decoder_inputs +
      ",\"decoderSampleTimestampMs\":" +
      std::to_string(custom_sample.timestamp_ms) +
      ",\"decoderActive\":" + (decoder.active ? "true" : "false") +
      ",\"decoderHealth\":\"" + decoder_health_name(decoder.result.health) + "\"" +
      ",\"decoderGeneration\":" + std::to_string(decoder.result.generation) +
      ",\"decoderPosition\":\"" +
      (decoder.result.position_valid
           ? (decoder.result.position == gate::signal_decoder::PositionValue::kOpened ? "opened" : "closed")
           : "unknown") + "\"" +
      ",\"decoderMovement\":\"" +
      (decoder.result.movement_valid
           ? (decoder.result.movement == gate::signal_decoder::MovementValue::kOpening ? "opening" :
              decoder.result.movement == gate::signal_decoder::MovementValue::kClosing ? "closing" : "stopped")
           : "unknown") + "\"" +
      ",\"decoderObstructed\":" + (decoder.result.obstructed ? "true" : "false") +
      ",\"decoderRules\":" + decoder_rules +
      ",\"decoderPredicates\":" + decoder_predicates +
      ",\"relayControlEnabled\":" +
      std::string(gate::runtime::active() ? "true" : "false") + "}";
  httpd_resp_set_type(request, "application/json");
  httpd_resp_set_hdr(request, "Cache-Control", "no-store");
  return httpd_resp_send(request, response.c_str(), response.size());
}

esp_err_t relay_pulse_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  switch (gate::runtime::request_bench_pulse()) {
    case gate::runtime::RequestResult::kAccepted:
      httpd_resp_set_status(request, "202 Accepted");
      httpd_resp_set_type(request, "application/json");
      return httpd_resp_sendstr(request, "{\"accepted\":true}");
    case gate::runtime::RequestResult::kBusy:
      return send_error(request, "409 Conflict",
                        "Relay pulse is active or cooling down. Try again shortly.");
    case gate::runtime::RequestResult::kHardwareError:
      return send_error(request, "500 Internal Server Error",
                        "Relay GPIO activation failed.");
    case gate::runtime::RequestResult::kUnavailable:
      return send_error(request, "503 Service Unavailable",
                        "Gate runtime is not available.");
  }
  return ESP_FAIL;
}

esp_err_t gate_target_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  const bool opening = request->user_ctx == nullptr;
  const auto target = opening ? gate::controller::Target::kOpen
                              : gate::controller::Target::kClosed;
  switch (gate::runtime::request_target(target)) {
    case gate::runtime::RequestResult::kAccepted:
      httpd_resp_set_status(request, "202 Accepted");
      httpd_resp_set_type(request, "application/json");
      return httpd_resp_sendstr(request, opening
          ? "{\"accepted\":true,\"target\":\"OPEN\"}"
          : "{\"accepted\":true,\"target\":\"CLOSED\"}");
    case gate::runtime::RequestResult::kBusy:
      return send_error(request, "409 Conflict",
                        opening
                            ? "The open command is interlocked or the operator is busy."
                            : "The close command is interlocked or the operator is busy.");
    case gate::runtime::RequestResult::kHardwareError:
      return send_error(request, "500 Internal Server Error",
                        "The configured operator output could not be activated.");
    case gate::runtime::RequestResult::kUnavailable:
      return send_error(request, "503 Service Unavailable",
                        "Gate runtime is not available.");
  }
  return ESP_FAIL;
}

esp_err_t homekit_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request)) {
    return send_error(request, "401 Unauthorized", "Authentication required.");
  }
  const std::string& code = config().homekit.setup_code;
  const std::string formatted_code =
      code.size() == 8 ? code.substr(0, 3) + "-" + code.substr(3, 2) + "-" +
                             code.substr(5, 3)
                       : code;
  const std::string response =
      "{\"active\":" +
      std::string(gate::homekit::active() ? "true" : "false") +
      ",\"paired\":" +
      std::string(gate::homekit::paired() ? "true" : "false") +
      ",\"setupCode\":\"" + json_escape(formatted_code.c_str()) +
      "\",\"setupId\":\"" +
      json_escape(config().homekit.setup_id.c_str()) + "\"}";
  httpd_resp_set_type(request, "application/json");
  httpd_resp_set_hdr(request, "Cache-Control", "no-store");
  return httpd_resp_send(request, response.c_str(), response.size());
}

