dlbogdan/Garage-Door-ESP32/components/management_api/management_api.cpp
esp_err_t update_config_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  if (request->content_len <= 0 || request->content_len > 16384) {
    return send_error(request, "400 Bad Request", "Invalid settings request.");
  }
  std::string body(request->content_len, '\0');
  std::size_t received = 0;
  while (received < body.size()) {
    const int count = httpd_req_recv(request, body.data() + received,
                                     body.size() - received);
    if (count <= 0) return ESP_FAIL;
    received += static_cast<std::size_t>(count);
  }

  std::string display_name;
  std::string relay_level;
  std::string sensor_level;
  std::string sensor_pull;
  std::string feedback_endpoint;
  int relay_gpio = -1;
  int sensor_gpio = -1;
  int pulse_ms = 0;
  int opening_seconds = 0;
  int closing_seconds = 0;
  int feedback_stability_ms = 0;
  std::string operator_profile;
  std::string feedback_mode;
  std::string feedback_decoder;
  const bool has_operator_profile =
      form_value(body, "operatorProfile", &operator_profile);
  const bool has_feedback_mode = form_value(body, "feedbackMode", &feedback_mode);
  const bool has_feedback_decoder =
      form_value(body, "feedbackDecoder", &feedback_decoder);
  const bool canonical = has_operator_profile;
  if (has_feedback_mode && !has_operator_profile) {
    return send_error(request, "400 Bad Request",
                      "Operator profile and feedback topology must both be provided.");
  }
  if (!form_value(body, "displayName", &display_name) || display_name.empty() ||
      display_name.size() > 64 ||
      !parse_integer(body, "openingSeconds", 3, 180, &opening_seconds) ||
      !parse_integer(body, "closingSeconds", 3, 180, &closing_seconds) ||
      !parse_integer(body, "feedbackStabilityMs", 1000, 10000,
                     &feedback_stability_ms)) {
    return send_error(request, "400 Bad Request",
                      "One or more settings have an invalid format.");
  }

  gate::config::AppConfig updated = config();
  updated.homekit.display_name = display_name;
  if (!canonical) {
    if (!form_value(body, "relayLevel", &relay_level) ||
        !form_value(body, "sensorLevel", &sensor_level) ||
        !form_value(body, "sensorPull", &sensor_pull) ||
        !form_value(body, "feedbackEndpoint", &feedback_endpoint) ||
        !parse_integer(body, "relayGpio", 0, 39, &relay_gpio) ||
        !parse_integer(body, "sensorGpio", 0, 39, &sensor_gpio) ||
        !parse_integer(body, "pulseMs", 100, 2000, &pulse_ms) ||
        (relay_level != "low" && relay_level != "high") ||
        (sensor_level != "low" && sensor_level != "high") ||
        (sensor_pull != "none" && sensor_pull != "up" && sensor_pull != "down") ||
        (feedback_endpoint != "open" && feedback_endpoint != "closed")) {
      return send_error(request, "400 Bad Request", "Invalid legacy gate settings.");
    }
    updated.gate_operator.profile = gate::config::OperatorProfile::kSequential;
    updated.gate_operator.feedback_topology = gate::config::FeedbackTopology::kSingle;
    updated.gate_operator.step = {relay_gpio, parse_level(relay_level),
                                  static_cast<std::uint32_t>(pulse_ms)};
    updated.gate_operator.single_feedback = {
        sensor_gpio, parse_level(sensor_level), parse_pull(sensor_pull), 50};
    updated.gate_operator.single_active_endpoint =
        feedback_endpoint == "open" ? gate::config::FeedbackEndpoint::kOpen
                                    : gate::config::FeedbackEndpoint::kClosed;
  } else {
    if ((operator_profile != "sequential" && operator_profile != "directional") ||
        (has_feedback_mode && feedback_mode != "single" && feedback_mode != "dual")) {
      return send_error(request, "400 Bad Request", "Invalid operator discriminators.");
    }
    updated.gate_operator.profile = operator_profile == "directional"
        ? gate::config::OperatorProfile::kDirectional
        : gate::config::OperatorProfile::kSequential;
    if (has_feedback_mode) {
      updated.gate_operator.feedback_topology = feedback_mode == "dual"
          ? gate::config::FeedbackTopology::kDual
          : gate::config::FeedbackTopology::kSingle;
    }

    if (has_feedback_decoder && feedback_decoder != "customRules") {
      return send_error(request, "400 Bad Request", "Invalid feedback decoder profile.");
    }
    const bool custom = true;
    updated.gate_operator.decoder.profile =
        gate::config::FeedbackDecoderProfile::kCustomRules;

    auto parse_output = [&](const char* gpio_name, const char* level_name,
                            const char* pulse_name,
                            gate::config::PulseOutputConfig* output) {
      std::string level;
      int gpio = -1;
      int pulse = 0;
      if (!parse_integer(body, gpio_name, 0, 39, &gpio) ||
          !form_value(body, level_name, &level) ||
          !parse_integer(body, pulse_name, 100, 2000, &pulse) ||
          (level != "low" && level != "high")) return false;
      *output = {gpio, parse_level(level), static_cast<std::uint32_t>(pulse)};
      return true;
    };
    if (updated.gate_operator.profile == gate::config::OperatorProfile::kSequential) {
      if (!parse_output("stepGpio", "stepLevel", "stepPulseMs",
                        &updated.gate_operator.step)) {
        return send_error(request, "400 Bad Request", "Invalid STEP output.");
      }
    } else if (!parse_output("openGpio", "openLevel", "openPulseMs",
                             &updated.gate_operator.open) ||
               !parse_output("closeGpio", "closeLevel", "closePulseMs",
                             &updated.gate_operator.close)) {
      return send_error(request, "400 Bad Request", "Invalid directional outputs.");
    }

    auto parse_input = [&](const char* gpio_name, const char* level_name,
                           const char* pull_name,
                           gate::config::FeedbackInputConfig* input) {
      std::string level;
      std::string pull;
      int gpio = -1;
      if (!parse_integer(body, gpio_name, 0, 39, &gpio) ||
          !form_value(body, level_name, &level) ||
          !form_value(body, pull_name, &pull) ||
          (level != "low" && level != "high") ||
          (pull != "none" && pull != "up" && pull != "down")) return false;
      *input = {gpio, parse_level(level), parse_pull(pull), 50};
      return true;
    };
    if (!custom && updated.gate_operator.feedback_topology == gate::config::FeedbackTopology::kSingle) {
      if (!form_value(body, "feedbackEndpoint", &feedback_endpoint) ||
          (feedback_endpoint != "open" && feedback_endpoint != "closed") ||
          !parse_input("sensorGpio", "sensorLevel", "sensorPull",
                       &updated.gate_operator.single_feedback)) {
        return send_error(request, "400 Bad Request", "Invalid single feedback input.");
      }
      updated.gate_operator.single_active_endpoint =
          feedback_endpoint == "open" ? gate::config::FeedbackEndpoint::kOpen
                                      : gate::config::FeedbackEndpoint::kClosed;
    } else if (!custom && (!parse_input("openedSensorGpio", "openedSensorLevel",
                            "openedSensorPull", &updated.gate_operator.opened_feedback) ||
               !parse_input("closedSensorGpio", "closedSensorLevel",
                             "closedSensorPull", &updated.gate_operator.closed_feedback))) {
      return send_error(request, "400 Bad Request", "Invalid dual feedback inputs.");
    }

