dlbogdan/Garage-Door-ESP32/components/management_api/management_api.cpp
    if (custom) {
      using namespace gate::signal_decoder;
      gate::config::FeedbackDecoderConfig parsed;
      parsed.profile = gate::config::FeedbackDecoderProfile::kCustomRules;
      int input_count = 0;
      int rule_count = 0;
       if (!parse_integer(body, "decoderInputCount", 0,
                          DecoderLimits::kMaxInputs, &input_count) ||
           !parse_integer(body, "decoderRuleCount", 0,
                          DecoderLimits::kMaxRules, &rule_count)) {
        return send_error(request, "400 Bad Request", "Invalid decoder counts.");
      }
      parsed.input_count = static_cast<std::uint8_t>(input_count);
      parsed.rules.input_count = parsed.input_count;
      for (int i = 0; i < input_count; ++i) {
        const std::string prefix = "decoderInput" + std::to_string(i);
        std::string label, level, pull;
        int id = 0, gpio = 0, debounce = 0;
        if (!parse_integer(body, (prefix + "Id").c_str(), 0, 255, &id) ||
            !form_value(body, (prefix + "Label").c_str(), &label) ||
            label.empty() || label.size() > 32 ||
            !parse_integer(body, (prefix + "Gpio").c_str(), 0, 39, &gpio) ||
            !form_value(body, (prefix + "Level").c_str(), &level) ||
            !form_value(body, (prefix + "Pull").c_str(), &pull) ||
            !parse_integer(body, (prefix + "DebounceMs").c_str(), 10, 500, &debounce) ||
            (level != "low" && level != "high") ||
            (pull != "none" && pull != "up" && pull != "down")) {
          return send_error(request, "400 Bad Request", "Invalid declared decoder input.");
        }
        parsed.inputs[i] = {static_cast<InputId>(id), label,
                            {gpio, parse_level(level), parse_pull(pull),
                             static_cast<std::uint32_t>(debounce)}};
        parsed.rules.input_ids[i] = static_cast<InputId>(id);
      }
      parsed.rules.rule_count = static_cast<std::uint8_t>(rule_count);
      for (int r = 0; r < rule_count; ++r) {
        const std::string prefix = "decoderRule" + std::to_string(r);
        auto& rule = parsed.rules.rules[r];
        std::string label, outcome, expiry;
        int id = 0, group_count = 0, entry = 0, loss = 0, age = 0;
        if (!parse_integer(body, (prefix + "Id").c_str(), 0, 255, &id) ||
            !form_value(body, (prefix + "Label").c_str(), &label) ||
            label.empty() || label.size() > 32 ||
            !form_value(body, (prefix + "Outcome").c_str(), &outcome) ||
            !parse_integer(body, (prefix + "GroupCount").c_str(), 1,
                           DecoderLimits::kMaxGroupsPerRule, &group_count) ||
            !parse_integer(body, (prefix + "EntryMs").c_str(), 0,
                           std::numeric_limits<int>::max(), &entry) ||
            !parse_integer(body, (prefix + "LossMs").c_str(), 0,
                           std::numeric_limits<int>::max(), &loss) ||
            !parse_integer(body, (prefix + "AgeMs").c_str(), 0,
                           std::numeric_limits<int>::max(), &age) ||
            !form_value(body, (prefix + "Expiry").c_str(), &expiry)) {
          return send_error(request, "400 Bad Request", "Invalid decoder rule.");
        }
        rule.id = static_cast<RuleId>(id);
        rule.enabled = true;
        parsed.rule_labels[r] = label;
        rule.group_count = static_cast<std::uint8_t>(group_count);
        if (outcome == "opened" || outcome == "closed") {
          rule.output.kind = RuleOutputKind::kPosition;
          rule.output.position = outcome == "opened" ? PositionValue::kOpened : PositionValue::kClosed;
        } else if (outcome == "opening" || outcome == "closing" || outcome == "stopped") {
          rule.output.kind = RuleOutputKind::kMovement;
          rule.output.movement = outcome == "opening" ? MovementValue::kOpening :
                                 outcome == "closing" ? MovementValue::kClosing : MovementValue::kStopped;
          rule.movement = {static_cast<Tick>(entry), static_cast<Tick>(loss),
                           static_cast<Tick>(age),
                           expiry == "unknown" ? MatchAgeExpiry::kUnknown :
                           expiry == "obstructed" ? MatchAgeExpiry::kObstructed :
                           expiry == "unknownAndObstructed" ? MatchAgeExpiry::kUnknownAndObstructed : MatchAgeExpiry::kNone};
        } else if (outcome == "obstructed") {
          rule.output.kind = RuleOutputKind::kFault;
        } else {
          return send_error(request, "400 Bad Request", "Invalid decoder outcome.");
        }
        for (int g = 0; g < group_count; ++g) {
          const std::string group_prefix = prefix + "Group" + std::to_string(g);
          int predicate_count = 0;
          if (!parse_integer(body, (group_prefix + "PredicateCount").c_str(), 1,
                             DecoderLimits::kMaxPredicatesPerGroup, &predicate_count)) {
            return send_error(request, "400 Bad Request", "Invalid decoder alternative group.");
          }
          rule.groups[g].predicate_count = static_cast<std::uint8_t>(predicate_count);
          for (int p = 0; p < predicate_count; ++p) {
            const std::string pp = group_prefix + "Predicate" + std::to_string(p);
            std::string kind;
            int input_id = 0;
            if (!form_value(body, (pp + "Kind").c_str(), &kind) ||
                !parse_integer(body, (pp + "InputId").c_str(), 0, 255, &input_id)) {
              return send_error(request, "400 Bad Request", "Invalid decoder predicate.");
            }
            auto& predicate = rule.groups[g].predicates[p];
            predicate.input_id = static_cast<InputId>(input_id);
            if (kind == "stableLevel") {
              int level_value = 0, hold = 0;
              if (!parse_integer(body, (pp + "Level").c_str(), 0, 1, &level_value) ||
                  !parse_integer(body, (pp + "HoldMs").c_str(), 1,
                                 std::numeric_limits<int>::max(), &hold)) {
                return send_error(request, "400 Bad Request", "Invalid stable-level predicate.");
              }
              predicate.kind = PredicateKind::kStableLevel;
              predicate.stable = {level_value != 0, static_cast<Tick>(hold)};
            } else if (kind == "periodicEdges") {
              int minimum = 0, maximum = 0, edges = 0, window = 0, gap = 0;
              if (!parse_integer(body, (pp + "MinimumIntervalMs").c_str(), 1, std::numeric_limits<int>::max(), &minimum) ||
                  !parse_integer(body, (pp + "MaximumIntervalMs").c_str(), 1, std::numeric_limits<int>::max(), &maximum) ||
                  !parse_integer(body, (pp + "MinimumEdges").c_str(), 2, DecoderLimits::kMaxEdgesPerInput, &edges) ||
                  !parse_integer(body, (pp + "ObservationWindowMs").c_str(), 1, std::numeric_limits<int>::max(), &window) ||
                  !parse_integer(body, (pp + "MaximumGapMs").c_str(), 1, std::numeric_limits<int>::max(), &gap)) {
                return send_error(request, "400 Bad Request", "Invalid periodic predicate.");
              }
              predicate.kind = PredicateKind::kPeriodicEdges;
              predicate.periodic = {static_cast<Tick>(minimum), static_cast<Tick>(maximum),
                                    static_cast<std::uint8_t>(edges), static_cast<Tick>(window),
                                    static_cast<Tick>(gap)};
            } else return send_error(request, "400 Bad Request", "Unknown decoder predicate kind.");
          }
        }
      }
      updated.gate_operator.decoder = std::move(parsed);
    }
  }
  updated.gate_operator.endpoint_stability_ms = feedback_stability_ms;
  updated.timing.opening_ms = opening_seconds * 1000;
  updated.timing.closing_ms = closing_seconds * 1000;
  const auto errors = gate::config::validate(updated);
  if (!errors.empty()) {
    return send_error(request, "400 Bad Request",
                      errors.front().field + ": " + errors.front().message);
  }
  const esp_err_t result = gate::config::ConfigRepository().save(updated);
  if (result != ESP_OK) {
    ESP_LOGE(kTag, "Failed to save authenticated settings: %s",
             esp_err_to_name(result));
    return send_error(request, "500 Internal Server Error",
                      "Could not persist settings.");
  }
  config() = std::move(updated);
  httpd_resp_set_type(request, "application/json");
  httpd_resp_sendstr(request, "{\"saved\":true,\"restarting\":true}");
  // Hardware GPIO ownership, compiled decoder tables, and runtime histories are
  // startup-owned. Applying only the in-memory AppConfig would leave the active
  // board on the old wiring/rules, so activate every gate configuration change
  // through one controlled restart.
  api_context.schedule_restart();
  return ESP_OK;
}

esp_err_t display_name_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  if (request->content_len <= 0 || request->content_len > 128) {
    return send_error(request, "400 Bad Request", "Invalid display name request.");
  }
  std::string body(request->content_len, '\0');
  std::size_t received = 0;
  while (received < body.size()) {
    const int count = httpd_req_recv(request, body.data() + received,
                                     body.size() - received);
    if (count <= 0) return ESP_FAIL;
    received += static_cast<std::size_t>(count);
  }
  std::string display_name;
  if (!form_value(body, "displayName", &display_name) || display_name.empty() ||
      display_name.size() > 64) {
    return send_error(request, "400 Bad Request",
                      "Display name must contain 1 to 64 characters.");
  }
  gate::config::AppConfig updated = config();
  updated.homekit.display_name = display_name;
  const auto errors = gate::config::validate(updated);
  if (!errors.empty()) {
    return send_error(request, "400 Bad Request",
                      errors.front().field + ": " + errors.front().message);
  }
  const esp_err_t result = gate::config::ConfigRepository().save(updated);
  if (result != ESP_OK) {
    ESP_LOGE(kTag, "Failed to save display name: %s", esp_err_to_name(result));
    return send_error(request, "500 Internal Server Error",
                      "Could not persist display name.");
  }
  config() = std::move(updated);
  httpd_resp_set_type(request, "application/json");
  return httpd_resp_sendstr(request, "{\"saved\":true}");
}

esp_err_t password_change_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  if (request->content_len <= 0 || request->content_len > 512) {
    return send_error(request, "400 Bad Request", "Invalid password request.");
  }
  std::string body(request->content_len, '\0');
  std::size_t received = 0;
  while (received < body.size()) {
    const int count = httpd_req_recv(request, body.data() + received,
                                     body.size() - received);
    if (count <= 0) return ESP_FAIL;
    received += static_cast<std::size_t>(count);
  }

  std::string current_password;
  std::string new_password;
  std::string confirmation;
  const bool valid_format =
      form_value(body, "currentPassword", &current_password) &&
      form_value(body, "newPassword", &new_password) &&
      form_value(body, "confirmation", &confirmation) &&
      new_password.size() >= 10 && new_password.size() <= 128 &&
      new_password == confirmation;
  std::fill(confirmation.begin(), confirmation.end(), '\0');
  if (!valid_format) {
    std::fill(current_password.begin(), current_password.end(), '\0');
    std::fill(new_password.begin(), new_password.end(), '\0');
    return send_error(request, "400 Bad Request",
                      "New passwords must match and contain 10-128 characters.");
  }
  if (!gate::config::verify_admin_password(current_password,
                                            config().admin)) {
    std::fill(current_password.begin(), current_password.end(), '\0');
    std::fill(new_password.begin(), new_password.end(), '\0');
    vTaskDelay(pdMS_TO_TICKS(500));
    return send_error(request, "401 Unauthorized",
                      "Current administrator password is incorrect.");
  }
  std::fill(current_password.begin(), current_password.end(), '\0');

  gate::config::AppConfig updated = config();
  esp_err_t result = gate::config::derive_admin_password(new_password,
                                                          &updated.admin);
  std::fill(new_password.begin(), new_password.end(), '\0');
  if (result != ESP_OK) {
    return send_error(request, "500 Internal Server Error",
                      "Could not derive new administrator credentials.");
  }
  result = gate::config::ConfigRepository().save(updated);
  if (result != ESP_OK) {
    ESP_LOGE(kTag, "Failed to save administrator password: %s",
             esp_err_to_name(result));
    return send_error(request, "500 Internal Server Error",
                      "Could not persist the new password.");
  }

  config() = std::move(updated);
  gate::web_auth::clear_session();
  httpd_resp_set_hdr(request, "Set-Cookie",
                     "gate_session=; Path=/; HttpOnly; SameSite=Strict; Max-Age=0");
  httpd_resp_set_type(request, "application/json");
  return httpd_resp_sendstr(request, "{\"changed\":true}");
}

esp_err_t wifi_change_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  if (request->content_len <= 0 || request->content_len > 512) {
    return send_error(request, "400 Bad Request", "Invalid network request.");
  }
  std::string body(request->content_len, '\0');
  std::size_t received = 0;
  while (received < body.size()) {
    const int count = httpd_req_recv(request, body.data() + received,
                                     body.size() - received);
    if (count <= 0) return ESP_FAIL;
    received += static_cast<std::size_t>(count);
  }

