dlbogdan/Garage-Door-ESP32/components/management_api/management_api.cpp
  std::string ssid;
  std::string wifi_password;
  std::string admin_password;
  const bool valid_format =
      form_value(body, "ssid", &ssid) &&
      form_value(body, "wifiPassword", &wifi_password) &&
      form_value(body, "adminPassword", &admin_password) &&
      !ssid.empty() && ssid.size() <= 32 && wifi_password.size() <= 63 &&
      (wifi_password.empty() || wifi_password.size() >= 8);
  if (!valid_format) {
    std::fill(wifi_password.begin(), wifi_password.end(), '\0');
    std::fill(admin_password.begin(), admin_password.end(), '\0');
    return send_error(request, "400 Bad Request",
                      "Enter an SSID and either no password or 8-63 characters.");
  }
  if (!gate::config::verify_admin_password(admin_password,
                                            config().admin)) {
    std::fill(wifi_password.begin(), wifi_password.end(), '\0');
    std::fill(admin_password.begin(), admin_password.end(), '\0');
    vTaskDelay(pdMS_TO_TICKS(500));
    return send_error(request, "401 Unauthorized",
                      "Administrator password is incorrect.");
  }
  std::fill(admin_password.begin(), admin_password.end(), '\0');

  gate::config::AppConfig previous = config();
  gate::config::AppConfig updated = config();
  updated.wifi.ssid = ssid;
  updated.wifi.password = wifi_password;
  const auto errors = gate::config::validate(updated);
  if (!errors.empty()) {
    std::fill(wifi_password.begin(), wifi_password.end(), '\0');
    return send_error(request, "400 Bad Request",
                      errors.front().field + ": " + errors.front().message);
  }

  esp_err_t result = gate::config::ConfigRepository().save(updated);
  if (result != ESP_OK) {
    std::fill(wifi_password.begin(), wifi_password.end(), '\0');
    return send_error(request, "500 Internal Server Error",
                      "Could not persist the network configuration.");
  }

  const gate::bootstrap::Credentials previous_credentials = credentials();
  gate::bootstrap::set_station(&credentials(), ssid, wifi_password);
  std::fill(wifi_password.begin(), wifi_password.end(), '\0');
  result = gate::bootstrap::save(credentials());
  if (result != ESP_OK) {
    credentials() = previous_credentials;
    const esp_err_t rollback = gate::config::ConfigRepository().save(previous);
    if (rollback != ESP_OK) {
      ESP_LOGE(kTag, "Wi-Fi update rollback failed: %s",
               esp_err_to_name(rollback));
    }
    return send_error(request, "500 Internal Server Error",
                      "Could not persist bootstrap network credentials.");
  }

  config() = std::move(updated);
  httpd_resp_set_type(request, "application/json");
  httpd_resp_sendstr(request, "{\"saved\":true,\"restarting\":true}");
  api_context.schedule_restart();
  return ESP_OK;
}

esp_err_t logout_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  gate::web_auth::clear_session();
  httpd_resp_set_hdr(request, "Set-Cookie",
                     "gate_session=; Path=/; HttpOnly; SameSite=Strict; Max-Age=0");
  return httpd_resp_sendstr(request, "{}");
}

esp_err_t reboot_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  httpd_resp_set_type(request, "application/json");
  httpd_resp_sendstr(request, "{\"restarting\":true}");
  api_context.schedule_restart();
  return ESP_OK;
}

esp_err_t homekit_reset_handler(httpd_req_t* request) {
  if (!gate::web_auth::authorize(request, true)) {
    return send_error(request, "403 Forbidden", "Invalid session or CSRF token.");
  }
  const esp_err_t result = gate::homekit::reset_pairings();
  if (result != ESP_OK) {
    ESP_LOGE(kTag, "Could not reset Apple Home pairings: %s",
             esp_err_to_name(result));
    return send_error(request, "409 Conflict",
                      "Apple Home service is not active; restart and try again.");
  }
  httpd_resp_set_type(request, "application/json");
  return httpd_resp_sendstr(request,
                            "{\"reset\":true,\"paired\":false}");
}

}  // namespace

esp_err_t register_routes(httpd_handle_t server, Context context) {
  if (server == nullptr || context.credentials == nullptr ||
      context.active_config == nullptr || context.application_provisioned == nullptr ||
      context.send_error == nullptr || context.form_value == nullptr ||
      context.parse_integer == nullptr || context.json_escape == nullptr ||
      context.schedule_restart == nullptr) return ESP_ERR_INVALID_ARG;
  api_context = context;
  const httpd_uri_t routes[] = {
      {.uri = "/api/v1/session/login", .method = HTTP_POST, .handler = login_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/session", .method = HTTP_GET, .handler = session_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/config", .method = HTTP_GET, .handler = config_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/runtime", .method = HTTP_GET, .handler = runtime_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/gate/test-pulse", .method = HTTP_POST, .handler = relay_pulse_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/gate/open", .method = HTTP_POST, .handler = gate_target_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/gate/close", .method = HTTP_POST, .handler = gate_target_handler, .user_ctx = reinterpret_cast<void*>(1)},
      {.uri = "/api/v1/homekit", .method = HTTP_GET, .handler = homekit_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/homekit/pairings", .method = HTTP_DELETE, .handler = homekit_reset_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/config", .method = HTTP_PUT, .handler = update_config_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/config/name", .method = HTTP_PUT, .handler = display_name_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/access/password", .method = HTTP_PUT, .handler = password_change_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/network/wifi", .method = HTTP_PUT, .handler = wifi_change_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/backup", .method = HTTP_POST, .handler = backup_export_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/restore", .method = HTTP_POST, .handler = restore_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/session/logout", .method = HTTP_POST, .handler = logout_handler, .user_ctx = nullptr},
      {.uri = "/api/v1/system/reboot", .method = HTTP_POST, .handler = reboot_handler, .user_ctx = nullptr},
  };
  for (const auto& route : routes) {
    const esp_err_t result = httpd_register_uri_handler(server, &route);
    if (result != ESP_OK) return result;
  }
  return ESP_OK;
}

}  // namespace gate::management_api
